{
  "text": {
    "0": [
      "Olipa kerran kolme pientä porsasta, veljestä, jotka olivat samanpituisia, pyöreitä, vaaleanpunaisia ja samoilla iloisilla hännillä. Nimetkin kuulostivat samanlaiselta. Heidän nimensä olivat: Nif-Nif, Nuf-Nuf и Naf-Naf.",
      "Koko kesän ajan porsaat hyppivät vihreällä ruoholla, nauttivat auringon paistetta ja laiskottelivat lätäköissä. Mutta kohta tuli syksy:",
      "- Meidän pitää miettiä talvea, - sanoi Naf-Naf kerran veljilleen herätessään aikaisin aamulla. - Minä tärisen kylmyydestä. Rakennetaan talo ja vietetään talvi yhdessä saman lämpimän katon alla.",
      "image:plan-of-building.png"
    ],
    "1": [
      "Mutta hänen veljensä eivät halunneet aloittaa työt.",
      "- Kaikkeen vielä ehtii ja myös talveenkin on aikaa. Me voimme vielä pitää hauskaa, olla ulkona ja pelata, - sanoi Nif-Nif ja teki kuperkeikkan.",
      "- Tarvittaessa rakennan itselleni talon, sanoi Nuf-Nuf ja makasi lätäkköön.",
      "- Minäkin, - sanoi Nif-Nif.",
      "- Ihan miten haluatte. Rakennan talon itselleni, - sanoi Naf-Naf.",
      "Nif-Nif ja Nuf-Nuf päättivät ettei kiirettä ole ja pelasivat vaan omia porsaiden peleja; hyppivät ja tekivät kuperkeikoja koko ajan.",
      "- Tänään vielä pelataan, - he ajattelivat, - ja huomenna aloitamme työt.",
      "Mutta seuraavanakin päivänä he ajattelivat samaa.",
      "Päivästä toiseen sää muuttui kylmemmäksi ja kylmemmäksi. Ja vasta kun tien varrella iso lätäkkö alkoi aamuisin peitellä ohueen jääkuoren laiskat veljekset pääsivät alkaa työt."
    ],
    "2": [
      "Nif-Nif päätti, että on helpompi ja nopeampi on tehdä talon olkeista. Ketään kysymättä hän teki näin. Illaksi hänen talonsa oli jo valmis. Nif-Nif laittoi katolle viimeisen oljen ja ihan tyytyväisenä omasta talosta alkoi laulamaan:",
      "image:build-first-home.png",
      "Voisit käydä koko maailman ympäri",
      "Maailman ympäri, maailman ympäri,",
      "Parempaa taloa kuin tämä,",
      "Et löydä, et löydä!",
      "",
      "Laulamalla tätä laulua, Hän lähti Nuf-Nufin luo. Lähellä Nuf-Nuf rakensi myös oman talon. Hän oli yrittänyt lopettaa tylsän ja epämielenkiintoisen teon mahdollisimman nopeasti. Ensin kuten hänen veljensä hän halusi rakentaa oman talon oljista. Mutta sitten hän päätti, että semmosessa talossa olisi liian kylmää talvella. Talo olisi kestävämpää ja lämpimämpää, jos sen rakenteisiin oksista. Näin hän päättikin tehdä. Hän löi paaluja maahan, kietoi ne oksilla, kaatoi kuivia lehtiä katolle, ja illalla talo oli valmis. Nuf-Nuf käveli ylpeänä talon ympäri useamman kerran ja alkoi laulamaan:",
      "image:build-second-home.png",
      "Minulla on hyvä talo,",
      "Se on uusi, se on kestävä,",
      "Minä en pelkää sadetta, eikä ukkosta,",
      "Ei sadetta, eikä ukkosta, ei sadetta, eikä ukkosta!",
      "",
      "Hän ei ehtinyt laulamaan loppuun, kun Nif-Nif juoksisi pensaan takaa.",
      "",
      "- No niin, sinunkin talosi on nyt valmis! - sanoi Nif-Nif veljelle. - Minähän sanoin, että me saadaan hommat nopeasti valmiiksi! Nyt me ollaan vapaat, voidaan tehdä vapaasti mitä haluamme ja mitä keksimme!",
      "- Mennään Naf-Nafin luokse katsomaan minkälaisen talon hän oli rakentanut! – sanoi Nuf-Nuf. - Emme ole nähneet häntä pitkään!",
      "- Mennään katsomaan! - Nif-Nif myönsi.",
      "Naf-Naf oli jo rakentamassa talonsa jo useampia päiviä. Hän toi kivet, sekoitti savea ja nyt kaiken rauhassa rakensi itsellesi pysyvän ja vahvan talon, jossa hän voisi piilottaa tuulesta, sadesta ja pakkasesta. Hän teki taloon painavan oven tammista lukkineen, niin ettei susi lähimmästä metsästä voisi päästää hänen taloon.",
      "",
      "Nif-Nif ja Nuf-Nuf kerkesivät nähdä rakentamisprosessin.",
      "",
      "- Mitä olet rakentamassa? - yllättyneenä  Nif-Nif ja Nuf-Nuf huusivat samaan aikaan. - Mitä tämä on? Onko se talo possulle vai linna?"
    ],
    "3": [
      "image:build-3-home.png",
      "- Talon possulle on oltava linna! - rauhallisesti vastaisi heille Naf-Naf ja jatkoi työt.",
      "- Vai aiotko käydä sotaa jonkun kanssa? -Nif-Nif  murahti iloisesti ja iski silmää Nuf-Nufin suuntaan.",
      "",
      "Ja molemmat veljet olivat niin ilahtuneita, että heidän röhkäisy kuului kauas nurmikon yli. Mutta Naf-Naf ikään kuin mitään ei olisi tapahtunut, jatkoi talonsa kiviseinän rakentamista, laulamalla hiljaisesti:",
      "",
      "Mikään maailman petoeläin,",
      "Ei pääse tästä ovesta sisään",
      "Ovela, pelottava, pelottava petoeläin,",
      "Ei pääse tästä ovesta sisään!",
      "",
      "Olen kaikista viisain,",
      "Kaikista viisain, kaikista viisain!",
      "Rakennan talon kivistä,",
      "Kivistä, kivistä!",
      "",
      "- Mistä petoeläimestä hän puhuu? - kysyi Nif-Nif Nuf-Nufilta.",
      "- Mistä petoelämästä puhut? - kysyi Nuf-Nuf Naf-Nafilta.",
      "- Puhun susista! - vastasi Naf-Naf ja laittoi seinälle vielä yhden kiven.",
      "- Katsokaa, hän pelkää susia! - sanoi Nif-Nif.",
      "- Minkälaiset sudet täällä voi olla? - kysyi Nif-Nif.",
      "- Täällä ei ole yhtäkään susia! Hän on vain pelkuri! - lisäsi Nuf-Nuf.",
      "",
      "Ja molemmat possut alkoivat laulamaan ja tanssimaan:",
      "",
      "Emme pelkää harmaata susia,",
      "Harmaata susia, harmaata susia!",
      "Missä olet tyhmä susi,",
      "Vanha susi, pelottava susi?",
      "",
      "He halusivat kiusata Naf-Nafia, mutta hän ei reagoinut tähän.",
      "",
      "- Mennään Nuf-Nuf - sanoi sitten Nif-Nif. - Meillä ei ole mitään tekemistä täällä!"
    ],
    "4": [
      "Ja kaksi rohkeaa veljeä lähti kävelemään. Matkalla he lauloivat ja tanssivat, ja kun he tulivat metsään, he pitivät niin paljon melua, että herättivät susin, joka nukkui männyn alla.",
      "\n",
      "- Mikä melu täällä on? - vihainen ja nälkäinen susi murahti tyytymättömästi ja lähti siihen paikkaan josta kuulisi kahden pienen tyhmän possun kirkumista ja murinaa.",
      "- Minkälaiset sudet täällä voisi olla! - sillä ajalla sanoi Nif-Nif, joka oli nähnyt susia vain kuvissa.",
      "- Mehän otamme häntä nenästä kiinni! - lisäsi Nuf-Nuf, joka myöskään ei ollun nähnyt elävää susia.",
      "- Kaadetaan hänet alas ja sidotaan, ja potkitaan jaloilla, näin! – ilkutteli Nif-Nif.",
      "\n",
      "Ja yhtäkkiä he näkivät todellisen elävän suden! Hän seisoi suuren puun takana ja näytti niin pelottavalta, hänellä oli niin vihaiset silmät ja isot hampaat, että kylmä hiki ilmestyi pitkin Nif-Nifin ja Nuf-Nufin selkiä ja heidän häntänsä alkoi tärisee. Porsaat eivät pystyneet edes liikkumaan pelosta.",
      "Susi valmistautui hyppimään, napsautti hampaitaan, räpäytti oikealla silmällä, mutta possuille yhtäkkiä tuli järki ja huutaen he pakenivat pois metsästä. Heidän ei ole koskaan tarvinnut juosta näin nopeasti! Vilkkuvat kantapäät ja kohotettuja pölypilviä näkyi vaan ja jokainen porsas yritti rynnätä omaan taloonsa piiloon."
    ],
    "5": [
      "Nif-Nif ensimmäisenä pääsi omaan olkeiseen taloon ja viimeisessä hetkessä kerkesi sulkea oven ennen kuin susi pääsisi sisään.",
      "\n",
      "'- Avaa oven nyt! - huusi susi. - Muuten rikkoon sen!",
      "- En, - vastasi Nif-Nif, - en avaa!",
      "Oven ulkopuolelta kuului kauhean pedon hengitys.",
      "- Avaa oven nyt! - susi huusi. - Muuten puhallan sen niin, että koko talosi hajoaa!",
      "\n",
      "Mutta peloissa oleva Nif-Nif ei voinut enää vastata.",
      "\n",
      "Silloin susi alkoi puhaltaa: \"U-u-u-u-u-u!\" Oljet lensivät talon katolta, talon seinät tärisivät.Susi hengitti syvään vielä kerran ja puhalsi toisen kerran: \"U-u-u-u-u-u!\" Kun susi oli puhaltanut kolmannen kertaan -talo romahti ja sen palat lensi kaikkiin suuntiin, ikään kuin hurrikaanissa. Susi oli napsahtanut hampaitaan pienen possun kantapäiden edessä, mutta Nif-Nif taitavasti välttyi pakoon ja lähti juoksemaan. Minuutin päästä hän oli jo Nuf-Nufin oven edessä.",
      "\n",
      "Just silloin kun veljet kerkesivät sulkea ovet lukkoon, susi sanoi:",
      "- Nyt syön teidät molemmat!",
      "\n",
      "Nif-Nif ja Nuf-Nuf peloissa katsoivat toistensa, mutta susi oli liian väsynyt ja siksi hän oli päättänyt toimia ovelasti.",
      "\n",
      "- Minä vaihdoin mielen! - sanoi hän niin kovalla äänellä, että häntä kuulisi koko talossa. – Minä en aio syödä noita laihoja possuja! Lähden kotiin!",
      "- Kuulitko? - kysyi Nif-Nif Nuf-Nufilta. - Hän sanoi, ettei aikoo syödä meidät! Me olemme laihat!",
      "- Tämä on oikein hyvä! - sanoi Nuf-Nuf ja saman tien lopetti tärisemään."
    ],
    "6": [
      "Братьям стало весело, и они запели как ни в чем не бывало:",
      "\n",
      "Нам не страшен серый волк,",
      "Серый волк, серый волк!",
      "Где ты ходишь, глупый волк,",
      "Старый волк, страшный волк?",
      "\n",
      "А волк и не думал уходить. Он просто отошел в сторонку и притаился. Он с трудом сдерживал себя, чтобы не расхохотаться.",
      "- Как ловко я обманул двух глупых, маленьких поросят!",
      "\n",
      "Когда поросята совсем успокоились, волк взял овечью шкуру и осторожно подкрался к дому. У дверей он накрылся шкурой и тихо постучал.",
      "Ниф-Ниф и Нуф-Нуф очень испугались.",
      "\n",
      "- Кто там? - спросили они, и у них снова затряслись хвостики.",
      "- Это я, бедная маленькая овечка! - тонким, чужим голосом пропищал волк. ",
      "- Пустите меня переночевать, я отбилась от стада и очень-очень устала!",
      "- Овечку можно пустить! - согласился Нуф-Нуф. - Овечка не волк! "
    ],
    "7": [
      "Но когда поросята приоткрыли дверь, они увидели не овечку, а все того же зубастого волка. ",
      "Братья захлопнули дверь и изо всех сил налегли на нее, чтобы страшный зверь не смог к ним ворваться.",
      "\n",
      "Волк очень рассердился. Ему не удалось перехитрить поросят! Он сбросил с себя овечью шкуру и зарычал:",
      "- Ну, погодите же! От этого дома сейчас ничего не останется!",
      "\n",
      "И он принялся дуть. Дом немного покосился. Волк дунул второй, потом третий, потом четвертый раз. С крыши слетали листья, стены дрожали, но дом все еще стоял. И, только когда волк дунул в пятый раз, дом зашатался и развалился. Одна только дверь некоторое время еще стояла посреди развалин. В ужасе бросились поросята бежать. От страха у них отнимались ноги, каждая щетинка дрожала, носы пересохли. Братья мчались к дому Наф-Нафа.",
      "\n",
      "Волк нагонял их огромными скачками. Один раз он чуть не схватил Ниф-Нифа за заднюю ножку, но тот вовремя отдернул ее и прибавил ходу.",
      "\n",
      "Волк тоже поднажал. Он был уверен, что на этот раз поросята от него не убегут. Но ему опять не повезло. Поросята быстро промчались мимо большой яблони, даже не задев ее. А волк не успел свернуть и налетел на яблоню, которая осыпала его яблоками. Одно твердое яблоко ударило его между глаз. Большая шишка вскочила у волка на лбу. \n",
      "\n",
      "А Ниф-Ниф и Нуф-Нуф ни живы ни мертвы подбежали в это время к дому Наф-Нафа. Брат впустил их в дом и быстро закрыл дверь на засов. Бедные поросята были так напуганы, что ничего не могли сказать. Они молча бросились под кровать и там притаились. ",
      "image:runaway.png"
    ],
    "8": [
      "Наф-Наф сразу догадался, что за ними гнался волк. Но ему нечего было бояться в своем каменном доме. Он быстро закрыл дверь на засов, сел на табуреточку и запел:",
      "\n",
      "Никакой на свете зверь,",
      "Хитрый зверь, страшный зверь,",
      "Не откроет эту дверь,",
      "Эту дверь, эту дверь!",
      "\n",
      "Но тут как раз постучали в дверь.",
      "- Открывай без разговоров! - раздался грубый голос волка.",
      "- Как бы не так! И не подумаем! - твердым голосом ответил Наф-Наф. ",
      "- Ах, так! Ну, держитесь! Теперь я съем всех троих! ",
      "\n",
      "- Попробуй! - ответил из-за двери Наф-Наф, даже не привстав со своей табуреточки. Он знал, что ему и братьям нечего бояться в прочном каменном доме. Тогда волк втянул в себя побольше воздуха и дунул, как только мог! Но, сколько бы он ни дул, ни один даже самый маленький камень не сдвинулся с места. Волк посинел от натуги. Дом стоял как крепость. Тогда волк стал трясти дверь. Но дверь тоже не поддавалась. Волк стал от злости царапать когтями стены дома и грызть камни, из которых они были сложены, но он только обломал себе когти и испортил зубы. Голодному и злому волку ничего не оставалось делать, как убираться восвояси.",
      "Но тут он поднял голову и вдруг заметил большую, широкую трубу на крыше.",
      " \n",
      "- Ага! Вот через эту трубу я и проберусь в дом! - обрадовался волк. ",
      "\n",
      "Он осторожно влез на крышу и прислушался. В доме было тихо. Я все-таки закушу сегодня свежей поросятинкой! - подумал волк и, облизнувшись, полез в трубу. "
    ],
    "9": [
      "Но, как только он стал спускаться по трубе, поросята услышали шорох. А когда на крышу котла стала сыпаться сажа, умный Наф-Наф сразу догадался, в чем дело. Он быстро бросился к котлу, в котором на огне кипела вода, и сорвал с него крышку.",
      "\n",
      "- Милости просим! - сказал Наф-Наф и подмигнул своим братьям.",
      "\n",
      "Поросятам не пришлось долго ждать. Черный, как трубочист, волк бултыхнулся прямо в котел. Глаза у него вылезли на лоб, вся шерсть поднялась дыбом. С диким ревом ошпаренный волк вылетел обратно на крышу, скатился по ней на землю, перекувырнулся четыре раза через голову, и бросился в лес.",
      "А три брата, три маленьких поросенка, глядели ему вслед и радовались, что они так ловко проучили злого разбойника.",
      "\n",
      "Никакой на свете зверь,",
      "Не откроет эту дверь,",
      "Хитрый, страшный, страшный зверь,",
      "Не откроет эту дверь!",
      "Хоть полсвета обойдешь,",
      "Обойдешь, обойдешь,",
      "Лучше дома не найдешь,",
      "Не найдешь, не найдешь!",
      "Волк из леса никогда,",
      "Никогда, никогда",
      "Не вернется к нам сюда,",
      "К нам сюда, к нам сюда!",
      "\n",
      "С этих пор братья стали жить вместе, под одной крышей. "
    ],
    "10": [
      "Он стал спускаться по трубе, но поросята не услышали шорох.",
      "Поросятам не пришлось долго ждать. Черный, как трубочист, волк бултыхнулся прямо в дом. ",
      "Глаза у него были злые, вся шерсть поднялась дыбом. С диким ревом волк набросился на поросят.",
      "\n",
      "А три брата, три маленьких поросенка вжались в угол. Им больше некуда было бежать. Волк их обманул. "
    ],
    "11": [
      "Possut rakensi talonsa jo useampia päiviä. He toivat kivet, sekoittivat savea ja nyt kaiken rauhassa rakensivat itsellesi pysyvän ja vahvan talon, jossa he voisivat piilottaa tuulesta, sadesta ja pakkasesta. He tekivät taloon painavan oven tammista lukkineen, niin ettei susi lähimmästä metsästä voisi päästää heidän taloon."
    ],
    "12": [
      "Mutta kun possut avasi pikkasen ovea, huomasivat, ettei se ollut lammas, vaan vihainen susi. Veljekset sulki oven ja pitivät kiinni omalla painolla, ettei peloittava peto pääsisi sisään, mutta susi oli paljon vahvempi ja hänellä oli kovaa nälkää.",
      "\n",
      "Susi pääsi taloon ja söi possut. Tyytyväisenä hän lähti nukkumaan takaisin metsään."
    ],
    "13": [
      "Nif-Nif ja Nuf-Nuf oli yrittäneet lopettaa tylsän ja epämielenkiintoisen teon mahdollisimman nopeasti. Ensin he halusivat rakentaa oman talon oljista. Mutta sitten he päättivät, että semmosessa talossa olisi liian kylmää talvella. Talo olisi kestävämpää ja lämpimämpää, jos sen rakentaisiin oksista. Näin he päättivätkin tehdä. He löivät paaluja maahan, kietoivät ne oksilla, katoivät kuivia lehtiä katolle, ja illalla talo oli valmis. Nif-Nif ja Nuf-Nuf kävelivät ylpeänä talon ympäri useamman kerran ja alkoivät laulamaan:",
      "\n",
      "Meillä on hyvä talo,",
      "Se on uusi, se on kestävä,",
      "Minä en pelkää sadetta, eikä ukkosta,",
      "Ei sadetta, eikä ukkosta, ei sadetta, eikä ukkosta!",
      "\n",
      "- No niin, meidän talo on nyt valmis! - sanoi Nif-Nif veljelle. - Minähän sanoin, että me saadaan hommat nopeasti valmiiksi! Nyt me ollaan vapaat, voidaan tehdä vapaasti mitä haluamme ja mitä keksimme!",
      "- Mennään Naf-Nafin luokse katsomaan minkälaisen talon hän oli rakentanut! – sanoi Nuf-Nuf. - Emme ole nähneet häntä pitkään!",
      "- Mennään katsomaan! - Nif-Nif myönsi.",
      "Naf-Naf oli jo rakentamassa talonsa jo useampia päiviä. Hän toi kivet, sekoitti savea ja nyt kaiken rauhassa rakensi itsellesi pysyvän ja vahvan talon, jossa hän voisi piilottaa tuulesta, sadesta ja pakkasesta. Hän teki taloon painavan oven tammista lukkineen, niin ettei susi lähimmästä metsästä voisi päästää hänen taloon.",
      "",
      "Nif-Nif ja Nuf-Nuf kerkesivät nähdä rakentamisprosessin.",
      " \n",
      "- Mitä olet rakentamassa? - yllättyneenä  Nif-Nif ja Nuf-Nuf huusivat samaan aikaan. - Mitä tämä on? Onko se talo possulle vai linna?'"
    ],
    "14": [
      "Just silloin kun veljet sulki oven lukkoon, susi sanoi:",
      "- Nyt syön teidät molemmat!",
      "Nif-Nif ja Nuf-Nuf peloissa katsoivat toistensa, mutta susi oli liian väsynyt ja siksi hän oli päättänyt toimia ovelasti.",
      "- Minä vaihdoin mielen! - sanoi hän niin kovalla äänellä, että häntä kuulisi koko talossa. – Minä en aio syödä noita laihoja possuja! Lähden kotiin.",
      "- Kuulitko? - kysyi Nif-Nif Nuf-Nufilta. - Hän sanoi, ettei aikoo syödä meidät! Me olemme laihat!",
      "- Tämä on oikein hyvä! - sanoi Nuf-Nuf ja saman tien lopetti tärisemään."
    ],
    "15": [
      "Ja kaksi rohkeaa veljeä lähti kävelemään. Matkalla he lauloivat ja tanssivat. Iltaan asti he leikkivät talonsa vieressä olevan metsän reunassa."
    ]
  },
  "actions": {
    "0": ["Rakennetaan sama talo kaikille", "Jatketaa pelaamista"],
    "1": ["Rakennetaan yhdessä", "Rakennetaan jokainen itsellenne"],
    "2": ["Lähdetään Naf-Nafille"],
    "3": ["Mennään kävelemään metsään!", "Mennään pelamaan talon viereen!"],
    "4": ["Juostaan pakoon!"],
    "5": ["Huh, ehti"],
    "6": ["Päästään lammaksen sisään!", "Se on susi!"],
    "7": ["Juostaan taloon!"],
    "8": ["Laitetaan kannen pois", "Mitään ei tapahtuu"],
    "9": [],
    "10": []
  },
  "urls": {
    "listen": "https://www.youtube.com/watch?v=ESi_ytjUidM",
    "watch": "https://www.youtube.com/watch?v=EykBKFvvYd8",
    "download": "three-pigs-fi.pdf"
  }
}
